Revit 2027 API
ExternalFileReference.GetAbsolutePath Method
 Returns an absolute path to the referenced file, regardless of whether the PathType.Enum is relative or absolute.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetAbsolutePath()
Public Function GetAbsolutePath As ModelPath
public:
ModelPath^ GetAbsolutePath()
member GetAbsolutePath : unit -> ModelPath
Return Value
ModelPath
 A full path to the linked model.
Remarks
 ExternalFileReferences which are taken from a closed document will report their absolute path as of the last time the document was saved.
See Also
Reference
ExternalFileReference Class
Autodesk.Revit.DB Namespace